InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_Календарь</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рабочий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоРабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КСУ_ДоступКGoogleКалендарю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ДоступКGoogleКалендарю</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Календари</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарьВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ИА_КСУОбщийСервер/Ext/Module.bsl
Функция ОбновитьИзображение(ФизЛицо, ТипФото = "", уид) Экспорт
	
	ФотоФизЛицаДвоичныеДанные = ПолучитьФотоФизЛица(ФизЛицо, ТипФото);
	
	Возврат ПоместитьВоВременноеХранилище(ФотоФизЛицаДвоичныеДанные,уид);
	
КонецФункции

Функция ПолучитьФотоФизЛица(ФизЛицо, ТипФото="") Экспорт
	
	Фото = РегистрыСведений.ИА_ДанныеФизЛиц.ПолучитьФотоФизЛица(ФизЛицо,ТипФото);
	
    Возврат Фото;
	
КонецФункции

Процедура ОбновитьАватар(ФизЛицо = Неопределено, ИзАватара = Ложь, АдресВх = Неопределено, АдресИсх = Неопределено, уидИсх = Неопределено) Экспорт
	РежимАдресов =  АдресВх <> Неопределено; // работаем не с физ лицом, а с несохраненными данными
	
	Каталог = КаталогВременныхФайлов() + "IMConv\";
	СоздатьКаталог(Каталог);
	
	ИмяПриложения = Каталог + "runer.exe";
	СоздатьКонвертер(ИмяПриложения, Каталог);
	
    ИмяФайла = ПолучитьИмяВременногоФайла("jpg");
	ИмяНовойКартинки = ПолучитьИмяВременногоФайла("png");
	
	// исходное фото
	Если РежимАдресов Тогда
		ДД_Фото = ПолучитьИзВременногоХранилища(АдресВх);
	Иначе
	    ДД_Фото = ПолучитьФотоФизЛица(ФизЛицо,?(ИзАватара,"Аватар",""));
		Если ДД_Фото = Неопределено Тогда
			возврат;
		КонецЕсли;
	КонецЕсли;
	ДД_Фото.Записать(ИмяФайла);
	
	//
	Соотношение = "100x";	
	
	Попытка 
		ФВр = Новый Файл(ИмяФайла);
	    Shell = Новый COMОбъект("Shell.Application");
	    Folder = Shell.Namespace(ФВр.Путь);
	    размеры = Folder.GetDetailsOf(Folder.Items().item(ФВр.Имя), 26) + Folder.GetDetailsOf(Folder.Items().item(ФВр.Имя), 31); // раньше было в одном потом в другом
		р = Найти(размеры, "x");
		ширинаСтр = Лев(размеры, р - 2);
		высотаСтр = Сред(размеры, р + 2);
		
		попытка
			ширина = Число(ширинаСтр);
			высота = Число(высотаСтр);
		Исключение  // бывают глюки с нечитаемым символом по бокам
			ширина = Число(Сред(ширинаСтр,2));
			высота = Число(Сред(высотаСтр,1,СтрДлина(высотаСтр)-1));
		КонецПопытки;
		
		Если ширина > высота Тогда
			Соотношение = "x100";
		КонецЕсли;
	Исключение
	КонецПопытки;
	//
	ТекстКонв = "convert.exe  ""%ИмяФайла%""  -resize %Соотн% -gravity center -crop 100x100+0+0 -quality 90 ""2.png"" 
                 |convert.exe  ""2.png""  ( +clone -threshold -1 -negate -fill white -draw ""circle 50,50 50,0"" ) -alpha off -compose copy_opacity -composite -quality 90 ""%ИмяНовойКартинки%"" "; 
	ТекстКонв = СтрЗаменить(ТекстКонв, "%ИмяФайла%", ИмяФайла);
	ТекстКонв = СтрЗаменить(ТекстКонв, "%ИмяНовойКартинки%", ИмяНовойКартинки);
	ТекстКонв = СтрЗаменить(ТекстКонв, "%Соотн%", Соотношение);
    
    ТекстДок = Новый ТекстовыйДокумент();
    ТекстДок.УстановитьТекст(ТекстКонв);
    ТекстДок.Записать(Каталог + "cmd.txt", КодировкаТекста.ANSI);
	
	//
	КодВозврата = 0;
    ЗапуститьПриложение(ИмяПриложения,,Истина,КодВозврата);
   
	Если КодВозврата <> Неопределено Тогда
		ДД_Рез = Новый ДвоичныеДанные(ИмяНовойКартинки);
		Если РежимАдресов Тогда
			АдресИсх = ПоместитьВоВременноеХранилище(ДД_Рез, уидИсх);
		Иначе
			мен = РегистрыСведений.ИА_ДанныеФизЛиц.СоздатьМенеджерЗаписи();        	
			мен.ФизЛицо = ФизЛицо;
			мен.Прочитать();
			мен.ФотоАватар = Новый ХранилищеЗначения(ДД_Рез);
			мен.Записать();
		КонецЕсли;
	КонецЕсли; 
	УдалитьФайлы(ИмяФайла);
    УдалитьФайлы(ИмяНовойКартинки);

КонецПроцедуры

Процедура СоздатьКонвертер(ИмяПриложения, Каталог)
	ФайлПриложения = Новый Файл(ИмяПриложения);
	Если НЕ ФайлПриложения.Существует() Тогда
        ДД =  ПолучитьОбщийМакет("ИА_Приложение_Convert");
        ИмяАрхива = Каталог + "arc.zip";
        ДД.Записать(ИмяАрхива);
        
        Архив = Новый ЧтениеZIPФайла(ИмяАрхива);
        Архив.ИзвлечьВсе(Каталог,РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
    КонецЕсли;
КонецПроцедуры

Функция Картинки_ИзменитьРазмер(ИмяФайлаИлиДД, НоваяШирина, НоваяВысота, НовоеСоотношениеСторон = 0) Экспорт 
	
	Результат = Новый Структура("ИмяФайла, Выполнено, ДДКартинки", "", Ложь);
    
    Каталог = КаталогВременныхФайлов() + "IMConv\";
    СоздатьКаталог(Каталог);
    ИмяПриложения = Каталог + "runer.exe";
    СоздатьКонвертер(ИмяПриложения, Каталог);
    
    РежимДД = ТипЗнч(ИмяФайлаИлиДД) <> Тип("Строка");
    Если РежимДД Тогда
        ИмяФайла = ПолучитьИмяВременногоФайла("jpg");
        ИмяФайлаИлиДД.Записать(ИмяФайла);
    Иначе
        ИмяФайла = ИмяФайлаИлиДД;
	КонецЕсли; 
    
    ИмяНовойКартинки = ПолучитьИмяВременногоФайла("jpg");    
    КодВозврата = 0;
    
    ТекстДок = Новый ТекстовыйДокумент();
    Если НовоеСоотношениеСторон = 0 Тогда
        СтрокаПараметров = """" + Каталог + "convert.exe"" "
        + " """ + ИмяФайла + """ "
        + " -resize " + Формат(НоваяШирина, "ЧГ=") +"x" + Формат(НоваяВысота, "ЧГ=")
        + " -quality 90 """ + ИмяНовойКартинки + """ "
    Иначе
        НоваяШирина = НоваяВысота * НовоеСоотношениеСторон;
        СтрокаПараметров = """" + Каталог + "convert.exe"" "
        + " """ + ИмяФайла + """ "
        + " -resize x" + Формат(НоваяВысота, "ЧГ=")
        + " -gravity center -crop " + Формат(НоваяШирина, "ЧГ=") + "x" + Формат(НоваяВысота, "ЧГ=") + "+0+0"
        + " -quality 90 """ + ИмяНовойКартинки + """ "
        
    КонецЕсли; 
    ТекстДок.УстановитьТекст(СтрокаПараметров);
    ТекстДок.Записать(Каталог + "cmd.txt", КодировкаТекста.ANSI);
    
    ЗапуститьПриложение(ИмяПриложения,,Истина,КодВозврата);
    //УдалитьФайлы(Каталог, "*.*");
    Если КодВозврата = 0 Тогда
        Результат.Выполнено = Истина;
        Результат.ИмяФайла = ИмяНовойКартинки;
        Если РежимДД Тогда
            Результат.ДДКартинки = Новый ДвоичныеДанные(ИмяНовойКартинки);
            Ф = Новый Файл(ИмяФайла);
            УдалитьФайлы(Ф.Путь, Ф.Имя);
            Ф = Новый Файл(ИмяНовойКартинки);
            УдалитьФайлы(Ф.Путь, Ф.Имя);
        КонецЕсли; 
    КонецЕсли; 
    
    Возврат Результат;
	
КонецФункции

Функция ТекущийПользователь() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

//_____________________________________________________________
// Работа  календарем

Процедура Календарь_ЗаполнитьПоПрКалендарю(ДанныеДляЗагрузки, ДатаНачала, ДатаКонца, КолРабочихЧасовПятница, КолРабочихЧасов) Экспорт
	
	мДниНедели = Новый Соответствие();
	мДниНедели.Вставить(1, "ПН");
	мДниНедели.Вставить(2, "ВТ");
	мДниНедели.Вставить(3, "СР");
	мДниНедели.Вставить(4, "ЧТ");
	мДниНедели.Вставить(5, "ПТ");
	мДниНедели.Вставить(6, "СБ");
	мДниНедели.Вставить(7, "ВС");
	
	
	ДанныеДляЗагрузки.Очистить();
	
	ИмяРегистраПроизводственногоКалендаря      = ИА_БФСПИ.Константа_Получить("ИА_ПроизводственныйКалендарьИмяРегистра");
	ИмяИзмеренияДатаПроизводственногоКалендаря = ИА_БФСПИ.Константа_Получить("ИА_ПроизводственныйКалендарьИзмерениеДата");
	
	Если ИмяРегистраПроизводственногоКалендаря = "ДанныеПроизводственногоКалендаря"  Тогда
		
		Если Метаданные.Константы.Найти("ОсновнойКалендарьПредприятия") <> Неопределено Тогда
			
			ОсновнойКалендарьПредприятия = Константы.ОсновнойКалендарьПредприятия.Получить();
			ПроизводственныйКалендарьПоУмолчанию =  ОсновнойКалендарьПредприятия.ПроизводственныйКалендарь;
			
		ИначеЕсли Метаданные.Справочники.Найти("ПроизводственныеКалендари") <> Неопределено Тогда
			
			//Арчил Тваладзе 22.04.2016 по другому не придумал, в УНФ нет ни константы  ОсновнойКалендарьПредприятия, ни чего аналогичного
			ПроизводственныйКалендарьПоУмолчанию = Справочники.ПроизводственныеКалендари.НайтиПоКоду("РФ");
			
		иначе 
			
			ПроизводственныйКалендарьПоУмолчанию = Неопределено;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПроизводственныйКалендарьПоУмолчанию) Тогда
			
			ИА_КСУОбщийКлиентСервер.СообщитьПользователю("Не заполнена константа ОсновнойКалендарьПредприятия");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря."+ИмяИзмеренияДатаПроизводственногоКалендаря+" Как Дата,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
	|				ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
	|				ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Рабочий
	|ИЗ
	|	РегистрСведений."+ИмяРегистраПроизводственногоКалендаря+" КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря."+ИмяИзмеренияДатаПроизводственногоКалендаря+" МЕЖДУ &ДатаНачала И &ДатаКонца";
	
	Если ИмяРегистраПроизводственногоКалендаря = "ДанныеПроизводственногоКалендаря"  Тогда
		
		Запрос.УстановитьПараметр("ПроизводственныйКалендарьПоУмолчанию", ПроизводственныйКалендарьПоУмолчанию);
		Запрос.Текст = Запрос.Текст +"				
		|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарьПоУмолчанию";
		
	КонецЕсли;

	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", ДатаКонца);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Новстр = ДанныеДляЗагрузки.Добавить();
		Новстр.Период = Результат.Дата;
		дн = ДеньНедели(Новстр.Период);
		Новстр.ДеньНедели = мДниНедели[дн];
		Новстр.Рабочий = Результат.Рабочий;
		Если Новстр.Рабочий Тогда
			Новстр.КоличествоРабочихЧасов = ?(дн = 5, КолРабочихЧасовПятница, КолРабочихЧасов)
		Иначе
			Новстр.КоличествоРабочихЧасов = 0;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

// Календарь_ДобавитьКДате - к "Дата" прибавить требуемое "КоличествоДней" "календарных", либо "рабочих"
// Параметры:
// Дата -Дата - дата начала
// КоличествоДней - Число - прибавляемое число дней
// ВариантДней - Число - 0 - Календарные; 1-рабочие. По-умолчанию: 1
Функция Календарь_ДобавитьКДате(Дата, КоличествоДней, ВариантДней = 1) Экспорт
    Результат = '00010101';
    
    Если ВариантДней = 0 Тогда
        Результат = НачалоДня(Дата) + КоличествоДней * 86400;
    Иначе
        Результат = ИА_БФС.Запрос_ВыполнитьСкалярный(
        "ВЫБРАТЬ
        |   ИА_Календарь.Период КАК Период,
        |   ИА_Календарь.Рабочий,
        |   ИА_Календарь.КоличествоРабочихЧасов
        |ПОМЕСТИТЬ Даты
        |ИЗ
        |   РегистрСведений.ИА_Календарь КАК ИА_Календарь
        |ГДЕ
        |   ИА_Календарь.Период >= &Дата
        |   И ИА_Календарь.Рабочий
        |
        |ИНДЕКСИРОВАТЬ ПО
        |   Период
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   Даты.Период КАК Результат,
        |   КОЛИЧЕСТВО(Даты1.Период) КАК Номер
        |ИЗ
        |   Даты КАК Даты
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Даты КАК Даты1
        |       ПО Даты.Период >= Даты1.Период
        |
        |СГРУППИРОВАТЬ ПО
        |   Даты.Период
        |
        |ИМЕЮЩИЕ
        |   КОЛИЧЕСТВО(Даты1.Период) = 1 + &КоличествоДней"
        , Новый Структура("Дата, КоличествоДней", Дата, КоличествоДней)); 
    КонецЕсли; 
    
	Возврат Результат;	
КонецФункции
 

//_____________________________________________________________
// Подписки на события

Процедура ИА_КСУ_ОбновлениеДанныхФизЛицПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.ЭтоГруппа Тогда
		возврат;
	КонецЕсли;
	//МТД 01.06.2021
	//В конфигурации отсутствует справочник физ. лица.
	
	//Если ТипЗнч(Источник) = Тип("СправочникОбъект.ФизическиеЛица") Тогда
	//    Фото = ПолучитьФотоФизЛица(Источник.Ссылка);
	//ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ХранилищеДополнительнойИнформации") Тогда
	//    Запрос = Новый Запрос;
	//    Запрос.Текст =
	//    "ВЫБРАТЬ
	//    |	ФизическиеЛица.Ссылка
	//    |ИЗ
	//    |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	//    |ГДЕ
	//    |	ФизическиеЛица.ОсновноеИзображение = &ОсновноеИзображение";
	//    Запрос.УстановитьПараметр("ОсновноеИзображение", Источник.Ссылка);
	//    Результат = Запрос.Выполнить();
	//    Выборка = Результат.Выбрать();
	//    Пока Выборка.Следующий() Цикл
	//        Фото = ПолучитьФотоФизЛица(Выборка.Ссылка);
	//    КонецЦикла;
	//КонецЕсли; 
КонецПроцедуры

Функция ЭтоПользовательКомцентра() Экспорт
	Возврат РедактированиеКомцентраДоступно() И ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.ПользовательКомцентра);
КонецФункции

Функция РедактированиеКомцентраДоступно() Экспорт
	Возврат ПравоДоступа("Редактирование", Метаданные.Задачи.ИА_ЗадачаПланаДействий);
КонецФункции

Функция ПросмотрСтатистикДоступен() Экспорт
	Возврат ПравоДоступа("Чтение", Метаданные.Документы.ИА_Статистика);	
КонецФункции

Функция РедактированиеСтатистикДоступно() Экспорт
	Возврат ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ИА_Статистика);		
КонецФункции

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИменаРеквизитов - Строка или Структура - если Строка, то имена реквизитов, 
//               перечисленные через запятую, в формате требований к свойствам структуры.
//               Например, "Код, Наименование, Родитель".
//               Если Структура, то в качестве ключа передается псевдоним поля для
//               возвращаемой структуры с результатом, а в качестве значения (опционально) 
//               - фактическое имя поля в таблице. 
//               Если значение не определено, то имя поля берется из ключа.
// 
// Возвращаемое значение:
//  Структура    - содержит список свойств, как список имен в строке
//                 ИменаРеквизитов, со значениям реквизитов, прочитанных
//                 из информационной базы.
// 
Функция ПолучитьЗначенияРеквизитов(Ссылка, ИменаРеквизитов) Экспорт

	Если ТипЗнч(ИменаРеквизитов) = Тип("Структура") Тогда
		СтруктураРеквизитов = ИменаРеквизитов;
	ИначеЕсли ТипЗнч(ИменаРеквизитов) = Тип("Строка") Тогда
		СтруктураРеквизитов = Новый Структура(ИменаРеквизитов);;
	Иначе
		ВызватьИсключение "Неверный тип второго параметра ИменаИлиСтруктураРеквизитов: "+ Строка(ТипЗнч(ИменаРеквизитов));
	КонецЕсли;

	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение), СокрЛП(КлючИЗначение.Значение), СокрЛП(КлючИЗначение.Ключ));
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
			|	" + ИмяПоля + " КАК " + Псевдоним;
	КонецЦикла;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|" + ТекстПолей + "
		|ИЗ
		|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
		|ГДЕ
		|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
		|");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);

	Возврат Результат;
КонецФункции

Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ПолучитьЗначенияРеквизитов(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции

Процедура ДобавитьЭлементОтбора(ЭлементыОтбораСписка, Фильтр, ВидСравнения, ЗначениеФильтра, ЗаполнятьПустым=ложь)  Экспорт 
	
	Если ЗначениеЗаполнено(ЗначениеФильтра) или ЗаполнятьПустым Тогда
		
		ЭлементОтбораСписка= ЭлементыОтбораСписка.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Фильтр);
		ЭлементОтбораСписка.ПравоеЗначение =ЗначениеФильтра;
		ЭлементОтбораСписка.ВидСравнения = ВидСравнения;
		ЭлементОтбораСписка.Использование = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

// если кнопка не определена, то первая видимая - основная
Процедура СделатьКнопкуОсновной(Панель, Кнопка = Неопределено, Найдено = ложь) Экспорт
	синий = Метаданные.ЭлементыСтиля.КСУ_ФонКнопкиТемный.Значение;
	голубой = Метаданные.ЭлементыСтиля.КСУ_ФонКнопкиСветлый.Значение;
	шрифтКн = Метаданные.ЭлементыСтиля.КСУ_ШрифтКнопки.Значение;
	ЦветТекстаКоричн = Метаданные.ЭлементыСтиля.КСУ_ЦветТекстаКнопки.Значение;
	
	Для каждого элем из Панель.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(элем) = Тип("КнопкаФормы") Тогда
			Если (элем = Кнопка) ИЛИ (Кнопка = Неопределено и элем.Видимость и не Найдено) Тогда
				элем.ЦветФона = синий;
				элем.ЦветТекста = Новый Цвет(255,255,255);
				элем.Шрифт = Новый Шрифт(шрифтКн,,,истина);
				
				Найдено = истина;
			Иначе
				элем.ЦветФона = голубой;
				элем.ЦветТекста = ЦветТекстаКоричн;
				элем.Шрифт = шрифтКн;
			КонецЕсли;
		ИначеЕсли (ТипЗнч(элем) = Тип("ГруппаФормы") ИЛИ ТипЗнч(элем) = Тип("ГруппаКнопокФормы")) и элем.Видимость Тогда
			СделатьКнопкуОсновной(элем, Кнопка, Найдено);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

функция ПолучитьДанныеПроектаКСУ() Экспорт
	Возврат Новый Структура("client_id,client_secret","509528655317-ki6ca0qg5un9pksfq55hiauejm28kdqm.apps.googleusercontent.com","npXUFdiRTNV7TRYJxekAL9Vl");
КонецФункции

Функция ПолучитьAccessTokenИзRefresh(Соединение, refresh_token = Неопределено) Экспорт
	Если refresh_token = Неопределено Тогда
		менП = РегистрыСведений.КСУ_ДоступКGoogleКалендарю.СоздатьМенеджерЗаписи();
		менп.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		менП.Прочитать();
		refresh_token = менП.Токен;
	КонецЕсли;
	
	Проект = ПолучитьДанныеПроектаКСУ();
	
	ПараметрыPOST = "grant_type=refresh_token&client_id=" + Проект.client_id + "&client_secret=" + Проект.client_secret + "&refresh_token=" + refresh_token;
	хеадерс = новый Соответствие;
	хеадерс.Вставить("Content-Type","application/x-www-form-urlencoded");
	
	Запрос = Новый HTTPЗапрос("/oauth2/v4/token", хеадерс);

	Запрос.УстановитьТелоИзСтроки(ПараметрыPOST, КодировкаТекста.Системная);
    Результат = Соединение.ОтправитьДляОбработки(Запрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	
	JSon = Новый ЧтениеJSON;
	JSon.УстановитьСтроку(ТекстОтвета);
	рез = ПрочитатьJSON(JSon);
	
	Возврат рез.access_token;
	
КонецФункции

Функция ПолучитьЦветФормы() Экспорт
	возврат ЦветаСтиля["ЦветФонаФормы"];
КонецФункции

Функция ЕстьСтатистики() Экспорт
	возврат ИА_Защита_Общий.ЛицензияДоступна("Статистика",,истина) и Константы.КСУ_ОтключитьСтатистикиВФП.Получить() = ложь;
КонецФункции
